Revit 2024 API
CameraInfo.IsPerspective Property
 Identifies whether the projection is orthographic or perspective
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsPerspective { get; }
Visual Basic
Public ReadOnly Property IsPerspective As Boolean
	Get
Visual C++
public:
property bool IsPerspective {
	bool get ();
}
See Also
CameraInfo Class
Autodesk.Revit.DB Namespace